GopalSaraf/Practicals/PSDL/include/proc/pic16f18856.h
extern volatile T5CONbits_t T5CONbits __at(0x21A);
// bitfield macros
#define _T5CON_ON_POSN                                      0x0
#define _T5CON_ON_POSITION                                  0x0
#define _T5CON_ON_SIZE                                      0x1
#define _T5CON_ON_LENGTH                                    0x1
#define _T5CON_ON_MASK                                      0x1
#define _T5CON_RD16_POSN                                    0x1
#define _T5CON_RD16_POSITION                                0x1
#define _T5CON_RD16_SIZE                                    0x1
#define _T5CON_RD16_LENGTH                                  0x1
#define _T5CON_RD16_MASK                                    0x2
#define _T5CON_nSYNC_POSN                                   0x2
#define _T5CON_nSYNC_POSITION                               0x2
#define _T5CON_nSYNC_SIZE                                   0x1
#define _T5CON_nSYNC_LENGTH                                 0x1
#define _T5CON_nSYNC_MASK                                   0x4
#define _T5CON_CKPS_POSN                                    0x4
#define _T5CON_CKPS_POSITION                                0x4
#define _T5CON_CKPS_SIZE                                    0x2
#define _T5CON_CKPS_LENGTH                                  0x2
#define _T5CON_CKPS_MASK                                    0x30
#define _T5CON_TMR5ON_POSN                                  0x0
#define _T5CON_TMR5ON_POSITION                              0x0
#define _T5CON_TMR5ON_SIZE                                  0x1
#define _T5CON_TMR5ON_LENGTH                                0x1
#define _T5CON_TMR5ON_MASK                                  0x1
#define _T5CON_T5RD16_POSN                                  0x1
#define _T5CON_T5RD16_POSITION                              0x1
#define _T5CON_T5RD16_SIZE                                  0x1
#define _T5CON_T5RD16_LENGTH                                0x1
#define _T5CON_T5RD16_MASK                                  0x2
#define _T5CON_nT5SYNC_POSN                                 0x2
#define _T5CON_nT5SYNC_POSITION                             0x2
#define _T5CON_nT5SYNC_SIZE                                 0x1
#define _T5CON_nT5SYNC_LENGTH                               0x1
#define _T5CON_nT5SYNC_MASK                                 0x4
#define _T5CON_T5CKPS0_POSN                                 0x4
#define _T5CON_T5CKPS0_POSITION                             0x4
#define _T5CON_T5CKPS0_SIZE                                 0x1
#define _T5CON_T5CKPS0_LENGTH                               0x1
#define _T5CON_T5CKPS0_MASK                                 0x10
#define _T5CON_T5CKPS1_POSN                                 0x5
#define _T5CON_T5CKPS1_POSITION                             0x5
#define _T5CON_T5CKPS1_SIZE                                 0x1
#define _T5CON_T5CKPS1_LENGTH                               0x1
#define _T5CON_T5CKPS1_MASK                                 0x20
#define _T5CON_CKPS0_POSN                                   0x4
#define _T5CON_CKPS0_POSITION                               0x4
#define _T5CON_CKPS0_SIZE                                   0x1
#define _T5CON_CKPS0_LENGTH                                 0x1
#define _T5CON_CKPS0_MASK                                   0x10
#define _T5CON_CKPS1_POSN                                   0x5
#define _T5CON_CKPS1_POSITION                               0x5
#define _T5CON_CKPS1_SIZE                                   0x1
#define _T5CON_CKPS1_LENGTH                                 0x1
#define _T5CON_CKPS1_MASK                                   0x20
#define _T5CON_RD165_POSN                                   0x1
#define _T5CON_RD165_POSITION                               0x1
#define _T5CON_RD165_SIZE                                   0x1
#define _T5CON_RD165_LENGTH                                 0x1
#define _T5CON_RD165_MASK                                   0x2

// Register: T5GCON
#define T5GCON T5GCON
extern volatile unsigned char           T5GCON              __at(0x21B);
#ifndef _LIB_BUILD
asm("T5GCON equ 021Bh");
#endif
// aliases
extern volatile unsigned char           PR5                 __at(0x21B);
#ifndef _LIB_BUILD
asm("PR5 equ 021Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned GVAL                   :1;
        unsigned GGO_nDONE              :1;
        unsigned GSPM                   :1;
        unsigned GTM                    :1;
        unsigned GPOL                   :1;
        unsigned GE                     :1;
    };
    struct {
        unsigned                        :2;
        unsigned T5GVAL                 :1;
        unsigned T5GGO_nDONE            :1;
        unsigned T5GSPM                 :1;
        unsigned T5GTM                  :1;
        unsigned T5GPOL                 :1;
        unsigned T5GE                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned T5GGO                  :1;
    };
} T5GCONbits_t;
extern volatile T5GCONbits_t T5GCONbits __at(0x21B);
// bitfield macros
#define _T5GCON_GVAL_POSN                                   0x2
#define _T5GCON_GVAL_POSITION                               0x2
#define _T5GCON_GVAL_SIZE                                   0x1
#define _T5GCON_GVAL_LENGTH                                 0x1
#define _T5GCON_GVAL_MASK                                   0x4
#define _T5GCON_GGO_nDONE_POSN                              0x3
#define _T5GCON_GGO_nDONE_POSITION                          0x3
#define _T5GCON_GGO_nDONE_SIZE                              0x1
#define _T5GCON_GGO_nDONE_LENGTH                            0x1
#define _T5GCON_GGO_nDONE_MASK                              0x8
#define _T5GCON_GSPM_POSN                                   0x4
#define _T5GCON_GSPM_POSITION                               0x4
#define _T5GCON_GSPM_SIZE                                   0x1
#define _T5GCON_GSPM_LENGTH                                 0x1
#define _T5GCON_GSPM_MASK                                   0x10
#define _T5GCON_GTM_POSN                                    0x5
#define _T5GCON_GTM_POSITION                                0x5
#define _T5GCON_GTM_SIZE                                    0x1
#define _T5GCON_GTM_LENGTH                                  0x1
#define _T5GCON_GTM_MASK                                    0x20
#define _T5GCON_GPOL_POSN                                   0x6
#define _T5GCON_GPOL_POSITION                               0x6
#define _T5GCON_GPOL_SIZE                                   0x1
#define _T5GCON_GPOL_LENGTH                                 0x1
#define _T5GCON_GPOL_MASK                                   0x40
#define _T5GCON_GE_POSN                                     0x7
#define _T5GCON_GE_POSITION                                 0x7
#define _T5GCON_GE_SIZE                                     0x1
#define _T5GCON_GE_LENGTH                                   0x1
#define _T5GCON_GE_MASK                                     0x80
#define _T5GCON_T5GVAL_POSN                                 0x2
#define _T5GCON_T5GVAL_POSITION                             0x2
#define _T5GCON_T5GVAL_SIZE                                 0x1
#define _T5GCON_T5GVAL_LENGTH                               0x1
#define _T5GCON_T5GVAL_MASK                                 0x4
#define _T5GCON_T5GGO_nDONE_POSN                            0x3
#define _T5GCON_T5GGO_nDONE_POSITION                        0x3
#define _T5GCON_T5GGO_nDONE_SIZE                            0x1
#define _T5GCON_T5GGO_nDONE_LENGTH                          0x1
#define _T5GCON_T5GGO_nDONE_MASK                            0x8
#define _T5GCON_T5GSPM_POSN                                 0x4
#define _T5GCON_T5GSPM_POSITION                             0x4
#define _T5GCON_T5GSPM_SIZE                                 0x1
#define _T5GCON_T5GSPM_LENGTH                               0x1
#define _T5GCON_T5GSPM_MASK                                 0x10
#define _T5GCON_T5GTM_POSN                                  0x5
#define _T5GCON_T5GTM_POSITION                              0x5
#define _T5GCON_T5GTM_SIZE                                  0x1
#define _T5GCON_T5GTM_LENGTH                                0x1
#define _T5GCON_T5GTM_MASK                                  0x20
#define _T5GCON_T5GPOL_POSN                                 0x6
#define _T5GCON_T5GPOL_POSITION                             0x6
#define _T5GCON_T5GPOL_SIZE                                 0x1
#define _T5GCON_T5GPOL_LENGTH                               0x1
#define _T5GCON_T5GPOL_MASK                                 0x40
#define _T5GCON_T5GE_POSN                                   0x7
#define _T5GCON_T5GE_POSITION                               0x7
#define _T5GCON_T5GE_SIZE                                   0x1
#define _T5GCON_T5GE_LENGTH                                 0x1
#define _T5GCON_T5GE_MASK                                   0x80
#define _T5GCON_T5GGO_POSN                                  0x3
#define _T5GCON_T5GGO_POSITION                              0x3
#define _T5GCON_T5GGO_SIZE                                  0x1
#define _T5GCON_T5GGO_LENGTH                                0x1
#define _T5GCON_T5GGO_MASK                                  0x8
// alias bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned GVAL                   :1;
        unsigned GGO_nDONE              :1;
        unsigned GSPM                   :1;
        unsigned GTM                    :1;
        unsigned GPOL                   :1;
        unsigned GE                     :1;
    };
    struct {
        unsigned                        :2;
        unsigned T5GVAL                 :1;
        unsigned T5GGO_nDONE            :1;
        unsigned T5GSPM                 :1;
        unsigned T5GTM                  :1;
        unsigned T5GPOL                 :1;
        unsigned T5GE                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned T5GGO                  :1;
    };
} PR5bits_t;
extern volatile PR5bits_t PR5bits __at(0x21B);
// bitfield macros
#define _PR5_GVAL_POSN                                      0x2
#define _PR5_GVAL_POSITION                                  0x2
#define _PR5_GVAL_SIZE                                      0x1
#define _PR5_GVAL_LENGTH                                    0x1
#define _PR5_GVAL_MASK                                      0x4
#define _PR5_GGO_nDONE_POSN                                 0x3
#define _PR5_GGO_nDONE_POSITION                             0x3
#define _PR5_GGO_nDONE_SIZE                                 0x1
#define _PR5_GGO_nDONE_LENGTH                               0x1
#define _PR5_GGO_nDONE_MASK                                 0x8
#define _PR5_GSPM_POSN                                      0x4
#define _PR5_GSPM_POSITION                                  0x4
#define _PR5_GSPM_SIZE                                      0x1
#define _PR5_GSPM_LENGTH                                    0x1
#define _PR5_GSPM_MASK                                      0x10
#define _PR5_GTM_POSN                                       0x5
#define _PR5_GTM_POSITION                                   0x5
#define _PR5_GTM_SIZE                                       0x1
#define _PR5_GTM_LENGTH                                     0x1
#define _PR5_GTM_MASK                                       0x20
#define _PR5_GPOL_POSN                                      0x6
#define _PR5_GPOL_POSITION                                  0x6
#define _PR5_GPOL_SIZE                                      0x1
#define _PR5_GPOL_LENGTH                                    0x1
#define _PR5_GPOL_MASK                                      0x40
#define _PR5_GE_POSN                                        0x7
#define _PR5_GE_POSITION                                    0x7
#define _PR5_GE_SIZE                                        0x1
#define _PR5_GE_LENGTH                                      0x1
#define _PR5_GE_MASK                                        0x80
#define _PR5_T5GVAL_POSN                                    0x2
#define _PR5_T5GVAL_POSITION                                0x2
#define _PR5_T5GVAL_SIZE                                    0x1
#define _PR5_T5GVAL_LENGTH                                  0x1
#define _PR5_T5GVAL_MASK                                    0x4
#define _PR5_T5GGO_nDONE_POSN                               0x3
#define _PR5_T5GGO_nDONE_POSITION                           0x3
#define _PR5_T5GGO_nDONE_SIZE                               0x1
#define _PR5_T5GGO_nDONE_LENGTH                             0x1
#define _PR5_T5GGO_nDONE_MASK                               0x8
#define _PR5_T5GSPM_POSN                                    0x4
#define _PR5_T5GSPM_POSITION                                0x4
#define _PR5_T5GSPM_SIZE                                    0x1
#define _PR5_T5GSPM_LENGTH                                  0x1
#define _PR5_T5GSPM_MASK                                    0x10
#define _PR5_T5GTM_POSN                                     0x5
#define _PR5_T5GTM_POSITION                                 0x5
#define _PR5_T5GTM_SIZE                                     0x1
#define _PR5_T5GTM_LENGTH                                   0x1
#define _PR5_T5GTM_MASK                                     0x20
#define _PR5_T5GPOL_POSN                                    0x6
#define _PR5_T5GPOL_POSITION                                0x6
#define _PR5_T5GPOL_SIZE                                    0x1
#define _PR5_T5GPOL_LENGTH                                  0x1
#define _PR5_T5GPOL_MASK                                    0x40
#define _PR5_T5GE_POSN                                      0x7
#define _PR5_T5GE_POSITION                                  0x7
#define _PR5_T5GE_SIZE                                      0x1
#define _PR5_T5GE_LENGTH                                    0x1
#define _PR5_T5GE_MASK                                      0x80
#define _PR5_T5GGO_POSN                                     0x3
#define _PR5_T5GGO_POSITION                                 0x3
#define _PR5_T5GGO_SIZE                                     0x1
#define _PR5_T5GGO_LENGTH                                   0x1
#define _PR5_T5GGO_MASK                                     0x8

// Register: T5GATE
#define T5GATE T5GATE
extern volatile unsigned char           T5GATE              __at(0x21C);
#ifndef _LIB_BUILD
asm("T5GATE equ 021Ch");
#endif
// aliases
extern volatile unsigned char           TMR5GATE            __at(0x21C);
#ifndef _LIB_BUILD
asm("TMR5GATE equ 021Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned GSS                    :5;
    };
    struct {
        unsigned GSS0                   :1;
        unsigned GSS1                   :1;
        unsigned GSS2                   :1;
        unsigned GSS3                   :1;
        unsigned GSS4                   :1;
    };
    struct {
        unsigned T5GSS0                 :1;
        unsigned T5GSS1                 :1;
        unsigned T5GSS2                 :1;
        unsigned T5GSS3                 :1;
        unsigned T5GSS4                 :1;
    };
} T5GATEbits_t;
